src/toir_cfe/src/Documents/проф_СводныйПланГрафикППР/проф_СводныйПланГрафикППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="576271cf-4949-49fd-b6ac-15dba97adcaf">
  <name>проф_СводныйПланГрафикППР</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="027c3586-1374-4754-b789-8232dc64a3c0">
    <name>НачалоПериодаПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f261372a-0877-4e94-94b0-44e34dcbadb1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00852d02-f1e5-4d28-a2f6-7479a468d382">
    <name>ИнтервалПересчетаПланГрафикаППР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1500600d-46b2-4306-9786-f3642ef14e52">
    <name>ИспользоватьНольДляРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="c731ff01-b76d-4bfc-a728-46ed1983e650">
    <name>СписокППР</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c2f1c321-bf9b-4415-8702-730e3fcec79e">
      <name>ПланГрафикППР</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/проф_СводныйПланГрафикППР/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// ++ Проф-ИТ, #227, Соловьев А.А., 19.09.2023

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборВТЧ(Команда)
	
	ЗначениеОтбора = Новый Структура("Проведен, Организация, ВидОперации", 
		Истина, Объект.Организация, ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот"));
	ПараметрыФормы = Новый Структура("Отбор, МножественныйВыбор", ЗначениеОтбора, Истина);
	ОткрытьФорму("Документ.торо_ПланГрафикРемонта.ФормаВыбора", ПараметрыФормы, Элементы.СписокППР);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание()
	
	#Если НЕ МобильныйКлиент Тогда
		
		проф_КорректировкаПланГрафиковППРРасписание = ПолучитьРасписаниеРегламентногоЗадания();
		
		Обработчик = Новый ОписаниеОповещения("РегламентныеЗаданияПослеИзмененияРасписания",
			ЭтотОбъект, "проф_КорректировкаПланГрафиковППРРасписание");
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(проф_КорректировкаПланГрафиковППРРасписание);
		Диалог.Показать(Обработчик);
		
	#КонецЕсли
	
КонецПроцедуры

// -- Проф-ИТ, #227, Соловьев А.А., 19.09.2023

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокППР

// ++ Проф-ИТ, #227, Соловьев А.А., 19.09.2023

&НаКлиенте
Процедура СписокППРОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбранныйДокумент Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.СписокППР.Добавить();
			НоваяСтрока.ПланГрафикППР = ВыбранныйДокумент;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

// -- Проф-ИТ, #227, Соловьев А.А., 19.09.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Проф-ИТ, #227, Соловьев А.А., 19.09.2023

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура РегламентныеЗаданияПослеИзмененияРасписания(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		проф_КорректировкаПланГрафиковППРРасписание = Расписание; 
		ЗаписатьРасписаниеРегламентногоЗадания(Расписание);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРегламентногоЗадания()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное("проф_КорректировкаПланГрафиковППР").Расписание;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьРасписаниеРегламентногоЗадания(Знач Расписание)
	
	РегламентноеЗаданиеФоновыйРасчет = РегламентныеЗадания.НайтиПредопределенное("проф_КорректировкаПланГрафиковППР");
	
	Если РегламентноеЗаданиеФоновыйРасчет.Расписание <> Расписание Тогда
		РегламентноеЗаданиеФоновыйРасчет.Расписание = Расписание;
		РегламентноеЗаданиеФоновыйРасчет.Записать();
	КонецЕсли;
	
КонецПроцедуры

// -- Проф-ИТ, #227, Соловьев А.А., 19.09.2023

#КонецОбласти
